## Import

In [3]:
import pandas as pd
import numpy as np
import json

## Datas Acquisition

In [4]:
list_of_name = ["Marwan", "Afnan", "Mukhlis", "Anas", "Khalid", "Iskandar", "Affan", "Ali"]

In [5]:
list_of_age = [21, 20, 21, 22, 20, 23, 22, 21]

In [6]:
list_of_job = ['it', 'rnd', 'it', 'eduction', 'libral art', 'islamic', 'it', 'rnd']

In [7]:
in_list = list(zip(list_of_name, list_of_age, list_of_job))

In [8]:
df = pd.DataFrame(in_list,  columns=['Name', 'Age', 'Job'])

In [9]:
df.set_index(['Name'], inplace=True)

## Data Prep

In [10]:
df.head()

         Age         Job
Name
Marwan    21          it
Afnan     20         rnd
Mukhlis   21          it
Anas      22    eduction
Khalid    20  libral art

In [11]:
s = df.loc['Marwan']

In [12]:
pd.Series(s)

Age    21
Job    it
Name: Marwan, dtype: object

In [13]:
im = 'Test2.csv'

In [66]:
df1 = pd.read_csv(im, dtype={'Age':int})

In [67]:
df1.sort_index()

       Name  Age         Job
0    Marwan   21          it
1     Afnan   20         rnd
2   Mukhlis   21          it
3      Anas   22    eduction
4    Khalid   20  libral art
5  Iskandar   23     islamic
6     Affan   22          it
7       Ali   21         rnd

In [71]:
df1.dtypes

Name    object
Age      int32
Job     object
dtype: object

In [72]:
df1.sample(5)

       Name  Age         Job
2   Mukhlis   21          it
4    Khalid   20  libral art
0    Marwan   21          it
3      Anas   22    eduction
5  Iskandar   23     islamic

In [74]:
df1.describe()

             Age
count   8.000000
mean   21.250000
std     1.035098
min    20.000000
25%    20.750000
50%    21.000000
75%    22.000000
max    23.000000

In [82]:
df1.Name = df1.Name.astype('category')

In [83]:
df1.dtypes

Name    category
Age        int32
Job       object
dtype: object

In [87]:
Names = df1.Name
s = pd.Series(Names)
s

0      Marwan
1       Afnan
2     Mukhlis
3        Anas
4      Khalid
5    Iskandar
6       Affan
7         Ali
Name: Name, dtype: category
Categories (8, object): [Affan, Afnan, Ali, Anas, Iskandar, Khalid, Marwan, Mukhlis]

In [88]:
df1.Name[1:4]

1      Afnan
2    Mukhlis
3       Anas
Name: Name, dtype: category
Categories (8, object): [Affan, Afnan, Ali, Anas, Iskandar, Khalid, Marwan, Mukhlis]

In [90]:
df1[['Name','Age']][1:5]

      Name  Age
1    Afnan   20
2  Mukhlis   21
3     Anas   22
4   Khalid   20

In [91]:
df1[1:6].Age

1    20
2    21
3    22
4    20
5    23
Name: Age, dtype: int32

In [93]:
rows = [0, 1, 5]
df1.iloc[rows]

       Name  Age      Job
0    Marwan   21       it
1     Afnan   20      rnd
5  Iskandar   23  islamic

## Data Searching

#### Only searching for the starting words

In [97]:
df1[df1.Name.str.match('Af')]

    Name  Age  Job
1  Afnan   20  rnd
6  Affan   22   it

In [98]:
df1[df1['Name'].str.match('Af')]

    Name  Age  Job
1  Afnan   20  rnd
6  Affan   22   it

#### Any word can be searched

In [100]:
df1[df1.Name.str.contains('an')]

       Name  Age      Job
0    Marwan   21       it
1     Afnan   20      rnd
5  Iskandar   23  islamic
6     Affan   22       it

In [101]:
df1[df1['Name'].str.contains('an')]

       Name  Age      Job
0    Marwan   21       it
1     Afnan   20      rnd
5  Iskandar   23  islamic
6     Affan   22       it

## Conditions

In [102]:
for i in df1:
    print(i)

Name
Age
Job

In [103]:
for idx in df1.iterrows():
    print(idx)

(0, Name    Marwan
Age         21
Job         it
Name: 0, dtype: object)
(1, Name    Afnan
Age        20
Job       rnd
Name: 1, dtype: object)
(2, Name    Mukhlis
Age          21
Job          it
Name: 2, dtype: object)
(3, Name        Anas
Age           22
Job     eduction
Name: 3, dtype: object)
(4, Name        Khalid
Age             20
Job     libral art
Name: 4, dtype: object)
(5, Name    Iskandar
Age           23
Job      islamic
Name: 5, dtype: object)
(6, Name    Affan
Age        22
Job        it
Name: 6, dtype: object)
(7, Name    Ali
Age      21
Job     rnd
Name: 7, dtype: object)

In [109]:
for idk, row in df1.iterrows():
    print(idk, row.Name, row.Age)

0 Marwan 21
1 Afnan 20
2 Mukhlis 21
3 Anas 22
4 Khalid 20
5 Iskandar 23
6 Affan 22
7 Ali 21